---
kind: property
id: P:Autodesk.Revit.DB.ScheduleField.HeadingOrientation
source: html/1b39a6a8-e775-d37b-99d5-e93165f350bb.htm
---
# Autodesk.Revit.DB.ScheduleField.HeadingOrientation Property

The orientation of the column heading text.

## Syntax (C#)
```csharp
public ScheduleHeadingOrientation HeadingOrientation { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration